import { Helmet } from 'react-helmet';

export const ContractPage = () => {
  return (
    <>
      <Helmet>
        <title>Договір</title>
      </Helmet>
      <div className="">
        <div className="mx-auto max-w-screen-lg">
          <h2 className="mb-6 text-xl font-bold text-gray-800 sm:mb-10 sm:text-4xl">
            Договір публічної оферти
          </h2>
          <ul>
            <li className="mb-4 text-sm font-normal text-gray-700 sm:mb-6 sm:text-lg">
              <h3 className="mb-4 text-xl font-bold italic text-gray-500 sm:mb-6 sm:text-3xl">
                Загальні положення
              </h3>
              <p className="mb-4">
                1.1. Справжня оферта є офіційною пропозицією fishstack.online, далі за текстом —
                «Продавець», укласти Договір купівлі-продажу товарів дистанційним способом, тобто
                через Інтернет-магазин, далі за текстом — «Договір», і розміщує Публічну оферту
                (пропозиція) на офіційному інтернет-сайті Продавця
                <a href="https://fishstack.online/" className="text-blue-500">
                  &nbsp;https://fishstack.online&nbsp;
                </a>
                (далі – «Інтернет-сайт»).
              </p>
              <p className="mb-4">
                1.2. Моментом повного та безумовного прийняття Покупцем пропозиції Продавця
                (акцептом) укласти електронний договір купівлі-продажу товарів, вважається факт
                оплати Покупцем замовлення на умовах цього Договору, у строки та за цінами,
                вказаними на Інтернет-сайті Продавця.
              </p>
            </li>

            <li className="mb-4 text-sm font-normal text-gray-700 sm:mb-6 sm:text-lg">
              <h3 className="mb-4 text-xl font-bold italic text-gray-500 sm:mb-6 sm:text-3xl">
                Поняття та визначення
              </h3>
              <p className="mb-4">
                2.1. У цій оферті, якщо контекст не вимагає іншого, наведені нижче терміни мають
                такі значення:
              </p>
              <p className="mb-4">* «Товар» – Риба, морепродукти, ікра, закуски;</p>
              <p className="mb-4">
                * «Інтернет-магазин» – відповідно до Закону України «про електронну комерцію», засіб
                для подання або реалізації товару, роботи чи послуги шляхом вчинення електронної
                угоди.
              </p>
              <p className="mb-4">
                * «Продавець» – компанія, що реалізує товари, які представлені на Інтернет-сайті.
              </p>
              <p className="mb-4">
                * «Покупець» – фізична особа, яка уклала з Продавцем Договір на умовах, викладених
                нижче.
              </p>
              <p className="mb-4">
                * «Замовлення» – вибір окремих позицій із переліку товарів, зазначених Покупцем під
                час розміщення замовлення та проведення оплати.
              </p>
            </li>

            <li className="mb-4 text-sm font-normal text-gray-700 sm:mb-6 sm:text-lg">
              <h3 className="mb-4 text-xl font-bold italic text-gray-500 sm:mb-6 sm:text-3xl">
                Предмет договору
              </h3>
              <p className="mb-4">
                3.1. Продавець зобов’язується передати у власність Покупця Товар, а Покупець
                зобов’язується сплатити та прийняти Товар на умовах цього Договору.
              </p>
              <p className="mb-4">
                Цей Договір регулює купівлю-продаж товарів в Інтернет-магазині, зокрема:
              </p>
              <p className="mb-4">– Добровільний вибір Покупцем товарів в Інтернет-магазині;</p>
              <p className="mb-4">
                – Самостійне оформлення Покупцем замовлення в Інтернет-магазині;
              </p>
              <p className="mb-4">– Оплата Покупцем замовлення, оформленого в Інтернет-магазині;</p>
              <p className="mb-4">
                – Обробка та доставка замовлення Покупцю у власність на умовах цього Договору.
              </p>
            </li>

            <li className="mb-4 text-sm font-normal text-gray-700 sm:mb-6 sm:text-lg">
              <h3 className="mb-4 text-xl font-bold italic text-gray-500 sm:mb-6 sm:text-3xl">
                Порядок оформлення замовлення
              </h3>
              <p className="mb-4">
                4.1. Покупець має право оформити замовлення на будь-який товар, представлений на
                Сайті Інтернет-магазину та наявний.
              </p>
              <p className="mb-4">
                4.2. Кожна позиція може бути представлена ​​в замовлення у будь-якій кількості.
              </p>
              <p className="mb-4">
                4.3. За відсутності товару на складі, Менеджер компанії зобов’язаний повідомити
                Покупця (по телефону або через електронну пошту).
              </p>
            </li>

            <li className="mb-4 text-sm font-normal text-gray-700 sm:mb-6 sm:text-lg">
              <h3 className="mb-4 text-xl font-bold italic text-gray-500 sm:mb-6 sm:text-3xl">
                Порядок оплати замовлення
              </h3>
              <p className="text-l mb-4 font-semibold text-gray-700 sm:text-xl">Оплата:</p>
              <p className="mb-4">
                5. Оплата здійснюється за готівку в гривнях за фактом отримання замовлення.
              </p>
              <p className="text-l mb-4 font-semibold text-gray-700 sm:text-xl">
                Умови доставки замовлення:
              </p>
              <p className="mb-4">
                6. Доставка товарів, придбаних в Інтернет-магазині, здійснюється до складів
                транспортних компаній, де й здійснюється видача замовлень.
              </p>
              <p className="text-l mb-4 font-semibold text-gray-700 sm:text-xl">
                Права та обов’язки сторін:
              </p>
              <p className="mb-2">7.1. Продавець має право:</p>
              <p className="mb-4">
                – в односторонньому порядку призупинити надання послуг за цим договором у разі
                порушення Покупцем умов цього договору.
              </p>
              <p className="mb-2">7.2. Покупець зобов’язаний:</p>
              <p className="mb-4">
                – своєчасно отримати та сплатити замовлення на умовах цього договору.
              </p>
              <p className="mb-2">7.3. Покупець має право:</p>
              <p className="mb-4">– оформити замовлення в Інтернет-магазині;</p>
              <p className="mb-4">– вимагати від Продавця виконання умов цього Договору.</p>
            </li>

            <li className="mb-4 text-sm font-normal text-gray-700 sm:mb-6 sm:text-lg">
              <h3 className="mb-4 text-xl font-bold italic text-gray-500 sm:mb-6 sm:text-3xl">
                Відповідальність сторін
              </h3>
              <p className="mb-4">
                8.1. Сторони несуть відповідальність за невиконання або неналежне виконання умов
                цього договору у порядку, передбаченому цим договором та чинним законодавством
                України.
              </p>
              <p className="mb-2">8.2. Продавець не несе відповідальності за:</p>
              <p className="mb-2">– змінений виробником зовнішній вигляд Товару;</p>
              <p className="mb-2">
                – за затримку та перебої у наданні Послуг (обробки замовлення та доставки товару),
                що відбуваються з причин, що знаходяться поза сферою його контролю;
              </p>
              <p className="mb-2">
                – за протиправні незаконні дії, здійснені Покупцем за допомогою цього доступу до
                мережі Інтернет;
              </p>
              <p className="mb-4">
                – за передачу Покупцем своїх мережевих ідентифікаторів – IP, MAC-адреси третім
                особам;
              </p>
              <p className="mb-4">
                8.3. Покупець, використовуючи наданий йому доступ до мережі Інтернет, самостійно
                несе відповідальність за шкоду, заподіяну його діями (особисто, навіть якщо під її
                логіном перебувала інша особа) особам або їхньому майну, юридичним особам, державі
                чи моральним принципам моральності.
              </p>
              <p className="mb-4">
                8.4. У разі настання обставин непереборної сили сторони звільняються від виконання
                умов цього договору. Під обставинами непереборної сили для цілей цього договору
                розуміються події, що мають надзвичайний, непередбачуваний характер, які виключають
                або об’єктивно заважають виконанню цього договору, настання яких Сторони не могли
                передбачити та запобігти розумним способам.
              </p>
              <p className="mb-4">
                8.5. Сторони докладають максимум зусиль для вирішення будь-яких суперечностей
                виключно шляхом переговорів.
              </p>
            </li>

            <li className="mb-4 text-sm font-normal text-gray-700 sm:mb-6 sm:text-lg">
              <h3 className="mb-4 text-xl font-bold italic text-gray-500 sm:mb-6 sm:text-3xl">
                Інші умови
              </h3>
              <p className="mb-4">
                9.1. Інтернет-магазин залишає за собою право в односторонньому порядку вносити зміни
                до цієї угоди за умови попередньої публікації її на сайті
                <a href="https://fishstack.online/" className="text-blue-500">
                  &nbsp;https://fishstack.online
                </a>
              </p>
              <p className="mb-4">
                9.2. Інтернет-магазин створений для організації дистанційного способу продажу
                товарів через Інтернет.
              </p>
              <p className="mb-4">
                9.3. Покупець несе відповідальність за достовірність зазначеної під час оформлення
                замовлення інформації. При цьому, при здійсненні акцепту (оформлення замовлення та
                подальшої оплати товару) Покупець надає Продавцю свою беззастережну згоду на
                збирання, обробку, зберігання, використання своїх персональних даних у розумінні ЗУ
                «Про захист персональних даних».
              </p>
              <p className="mb-4">
                9.4. Оплата Покупцем оформленого в Інтернет магазині замовлення означає повну згоду
                Покупця з умовами договору купівлі-продажу (публічної оферти)
              </p>
              <p className="mb-4">
                9.5. Фактичною датою електронної угоди між сторонами є дата прийняття умов
                відповідно до ст. 11 Закону України “Про електронну комерцію”
              </p>
              <p className="mb-4">
                9.6. Використання ресурсу Інтернет-магазину для попереднього перегляду товару, а
                також оформлення замовлення для Покупця є безкоштовним.
              </p>
              <p className="mb-4">
                9.7. Інформація, що надається Покупцем, є конфіденційною. Інтернет-магазин
                використовує інформацію про Покупця виключно з метою обробки замовлення,
                відправлення повідомлень Покупцю, доставки товару, здійснення взаєморозрахунків та
                ін.
              </p>
            </li>

            <li className="mb-4 text-sm font-normal text-gray-700 sm:mb-6 sm:text-lg">
              <h3 className="mb-4 text-xl font-bold italic text-gray-500 sm:mb-6 sm:text-3xl">
                Термін дії договору
              </h3>
              <p className="mb-4">
                10.1.Електронний договір вважається укладеним з моменту отримання особою, яка
                направила пропозицію укласти такий договір, відповіді про прийняття цієї пропозиції
                у порядку, визначеному частиною шостою статті 11 Закону України “Про електронну
                комерцію”.
              </p>
              <p className="mb-4">
                10.2. До закінчення терміну дії цей Договір може бути розірваний за взаємною згодою
                сторін до моменту фактичної доставки товару
              </p>
              <p className="mb-4">
                10.3. Сторони мають право розірвати цей договір в односторонньому порядку, у разі
                невиконання однієї із сторін умов цього Договору та у випадках, передбачених чинним
                законодавством України.
              </p>
            </li>
          </ul>
        </div>
      </div>
    </>
  );
};
